apache/nuttx/arch/xtensa/src/esp32/esp32_touch_lowerhalf.h
  return (enum touch_tie_opt_e) REG_GET_FIELD(reg_addr[tp_wrap],
                                              RTC_IO_TOUCH_PAD0_TIE_OPT);
}

/****************************************************************************
 * Name: touch_lh_set_fsm_mode
 *
 * Description:
 *   Set the mode of the internal touch finite state machine.
 *
 * Input Parameters:
 *   mode - The desired enum touch_fsm_mode_e value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_set_fsm_mode(enum touch_fsm_mode_e mode)
{
  REG_SET_FIELD(SENS_SAR_TOUCH_CTRL2_REG, SENS_TOUCH_START_FSM_EN, true);
  REG_SET_FIELD(SENS_SAR_TOUCH_CTRL2_REG, SENS_TOUCH_START_EN, false);
  REG_SET_FIELD(SENS_SAR_TOUCH_CTRL2_REG, SENS_TOUCH_START_FORCE, mode);
}

/****************************************************************************
 * Name: touch_lh_get_fsm_mode
 *
 * Description:
 *   Get the mode of the internal touch finite state machine.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current enum touch_fsm_mode_e.
 *
 ****************************************************************************/

static inline enum touch_fsm_mode_e touch_lh_get_fsm_mode(void)
{
  return (enum touch_fsm_mode_e)
    REG_GET_FIELD(SENS_SAR_TOUCH_CTRL2_REG, SENS_TOUCH_START_FORCE);
}

/****************************************************************************
 * Name: touch_lh_start_fsm
 *
 * Description:
 *   Start the internal touch finite state machine.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_start_fsm(void)
{
  REG_SET_FIELD(RTC_CNTL_STATE0_REG, RTC_CNTL_TOUCH_SLP_TIMER_EN, true);
}

/****************************************************************************
 * Name: touch_lh_stop_fsm
 *
 * Description:
 *   Stop the internal touch finite state machine.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_stop_fsm(void)
{
  REG_SET_FIELD(RTC_CNTL_STATE0_REG, RTC_CNTL_TOUCH_SLP_TIMER_EN, false);
}

/****************************************************************************
 * Name: touch_lh_start_sw_meas
 *
 * Description:
 *   Start measurement controlled by software.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_start_sw_meas(void)
{
  REG_SET_FIELD(SENS_SAR_TOUCH_CTRL2_REG, SENS_TOUCH_START_EN, false);
  REG_SET_FIELD(SENS_SAR_TOUCH_CTRL2_REG, SENS_TOUCH_START_EN, true);
}

/****************************************************************************
 * Name: touch_lh_set_threshold
 *
 * Description:
 *   Set the touch interrupt threshold for a given touch pad.
 *
 * Input Parameters:
 *   tp - The touch pad channel;
 *   threshold - The desired threshold value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_set_threshold(enum touch_pad_e tp,
                                          uint16_t threshold)
{
  enum touch_pad_e tp_wrap = touch_lh_num_wrap(tp);

  const uint32_t reg_addr[] =
  {
    SENS_SAR_TOUCH_THRES1_REG,
    SENS_SAR_TOUCH_THRES2_REG,
    SENS_SAR_TOUCH_THRES3_REG,
    SENS_SAR_TOUCH_THRES4_REG,
    SENS_SAR_TOUCH_THRES5_REG
  };

  if (tp_wrap & 0x1) /* Odd */
    {
      /* All odd touch pads have the same position for the THN bits.
       * We can use any odd SENS_TOUCH_OUT_THN.
       */

      REG_SET_FIELD(reg_addr[tp_wrap / 2], SENS_TOUCH_OUT_TH1, threshold);
    }
  else /* Even */
    {
      /* All even touch pads have the same position for the THN bits.
       * We can use any even SENS_TOUCH_OUT_THN.
       */

      REG_SET_FIELD(reg_addr[tp_wrap / 2], SENS_TOUCH_OUT_TH0, threshold);
    }
}

/****************************************************************************
 * Name: touch_lh_get_threshold
 *
 * Description:
 *   Get the touch interrupt threshold for a given touch pad.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   The current interrupt threshold for that touch pad.
 *
 ****************************************************************************/

static inline uint16_t touch_lh_get_threshold(enum touch_pad_e tp)
{
  enum touch_pad_e tp_wrap = touch_lh_num_wrap(tp);

  const uint32_t reg_addr[] =
  {
    SENS_SAR_TOUCH_THRES1_REG,
    SENS_SAR_TOUCH_THRES2_REG,
    SENS_SAR_TOUCH_THRES3_REG,
    SENS_SAR_TOUCH_THRES4_REG,
    SENS_SAR_TOUCH_THRES5_REG
  };

  if (tp_wrap & 0x1) /* Odd */
    {
      /* All odd touch pads have the same position for the THN bits.
       * We can use any odd SENS_TOUCH_OUT_THN.
       */

      return REG_GET_FIELD(reg_addr[tp_wrap / 2], SENS_TOUCH_OUT_TH1);
    }
  else /* Even */
    {
      /* All even touch pads have the same position for the THN bits.
       * We can use any even SENS_TOUCH_OUT_THN.
       */

      return REG_GET_FIELD(reg_addr[tp_wrap / 2], SENS_TOUCH_OUT_TH0);
    }
}

/****************************************************************************
 * Name: touch_lh_set_trigger_mode
 *
 * Description:
 *   Set the touch interrupt trigger mode.
 *
 * Input Parameters:
 *   mode - The desired enum touch_trigger_mode_e value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_set_trigger_mode(enum touch_trigger_mode_e mode)
{
  REG_SET_FIELD(SENS_SAR_TOUCH_CTRL1_REG, SENS_TOUCH_OUT_SEL, mode);
}

/****************************************************************************
 * Name: touch_lh_get_trigger_mode
 *
 * Description:
 *   Get the touch interrupt trigger mode.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current enum touch_trigger_mode_e.
 *
 ****************************************************************************/

static inline enum touch_trigger_mode_e touch_lh_get_trigger_mode(void)
{
  return (enum touch_trigger_mode_e)
    REG_GET_FIELD(SENS_SAR_TOUCH_CTRL1_REG, SENS_TOUCH_OUT_SEL);
}

/****************************************************************************
 * Name: touch_lh_set_trigger_source
 *
 * Description:
 *   Set the touch interrupt trigger source.
 *
 * Input Parameters:
 *   src - The desired enum touch_trigger_src_e value.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_set_trigger_source(enum touch_trigger_src_e src)
{
  REG_SET_FIELD(SENS_SAR_TOUCH_CTRL1_REG, SENS_TOUCH_OUT_1EN, src);
}

/****************************************************************************
 * Name: touch_lh_get_trigger_source
 *
 * Description:
 *   Get the touch interrupt trigger source.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   The current enum touch_trigger_src_e.
 *
 ****************************************************************************/

static inline enum touch_trigger_src_e touch_lh_get_trigger_source(void)
{
  return (enum touch_trigger_src_e)
    REG_GET_FIELD(SENS_SAR_TOUCH_CTRL1_REG, SENS_TOUCH_OUT_1EN);
}

/****************************************************************************
 * Name: touch_lh_set_channel_mask
 *
 * Description:
 *   Enable touch channels to be measured.
 *
 * Input Parameters:
 *   enable_mask - Bitmask containing the desired channels to be activated.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_set_channel_mask(uint16_t enable_mask)
{
  setbits(SENS_SAR_TOUCH_ENABLE_REG, (TOUCH_LH_BITS_SWAP(enable_mask) <<
    SENS_TOUCH_PAD_WORKEN_S));
}

/****************************************************************************
 * Name: touch_lh_get_channel_mask
 *
 * Description:
 *   Get the active touch channels to be measured.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   Bitmask of the current chennels being measured.
 *
 ****************************************************************************/

static inline uint16_t touch_lh_get_channel_mask(void)
{
  return TOUCH_LH_BITS_SWAP(
    REG_GET_FIELD(SENS_SAR_TOUCH_ENABLE_REG, SENS_TOUCH_PAD_WORKEN));
}

/****************************************************************************
 * Name: touch_lh_clear_channel_mask
 *
 * Description:
 *   Disable touch channels being measured.
 *
 * Input Parameters:
 *   disable_mask - Bitmask containing the desired channels to be disabled.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_clear_channel_mask(uint16_t disable_mask)
{
  resetbits(SENS_SAR_TOUCH_ENABLE_REG, (TOUCH_LH_BITS_SWAP(disable_mask) <<
    SENS_TOUCH_PAD_WORKEN_S));
}

/****************************************************************************
 * Name: touch_lh_set_group_mask
 *
 * Description:
 *   Enable channels in touch interrupt groups.
 *
 * Input Parameters:
 *   group1_mask - Bitmask containing the desired channels to be
 *                 added to SET1;
 *   group2_mask - Bitmask containing the desired channels to be
 *                 added to SET2.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

