apache/nuttx/arch/xtensa/src/esp32/esp32_touch_lowerhalf.h
static inline void touch_lh_set_group_mask(uint16_t group1_mask,
                                           uint16_t group2_mask)
{
  setbits(SENS_SAR_TOUCH_ENABLE_REG, (TOUCH_LH_BITS_SWAP(group1_mask) <<
    SENS_TOUCH_PAD_OUTEN1_S));

  setbits(SENS_SAR_TOUCH_ENABLE_REG, (TOUCH_LH_BITS_SWAP(group2_mask) <<
    SENS_TOUCH_PAD_OUTEN2_S));
}

/****************************************************************************
 * Name: touch_lh_get_channel_mask
 *
 * Description:
 *   Get the active touch interrupt groups.
 *
 * Input Parameters:
 *   group1_mask - Pointer to allocated uint16_t that will be modified to
 *                 return the current SET1 bitmask.
 *   group2_mask - Pointer to allocated uint16_t that will be modified to
 *                 return the current SET2 bitmask.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_get_group_mask(uint16_t *group1_mask,
                                           uint16_t *group2_mask)
{
  *group1_mask = TOUCH_LH_BITS_SWAP(
    REG_GET_FIELD(SENS_SAR_TOUCH_ENABLE_REG, SENS_TOUCH_PAD_OUTEN1));
  *group2_mask = TOUCH_LH_BITS_SWAP(
    REG_GET_FIELD(SENS_SAR_TOUCH_ENABLE_REG, SENS_TOUCH_PAD_OUTEN2));
}

/****************************************************************************
 * Name: touch_lh_clear_group_mask
 *
 * Description:
 *   Remove channels in touch interrupt groups.
 *
 * Input Parameters:
 *   group1_mask - Bitmask containing the desired channels to be
 *                 removed from SET1;
 *   group2_mask - Bitmask containing the desired channels to be
 *                 removed from SET2.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_clear_group_mask(uint16_t group1_mask,
                                             uint16_t group2_mask)
{
  resetbits(SENS_SAR_TOUCH_ENABLE_REG, (TOUCH_LH_BITS_SWAP(group1_mask) <<
    SENS_TOUCH_PAD_OUTEN1_S));

  resetbits(SENS_SAR_TOUCH_ENABLE_REG, (TOUCH_LH_BITS_SWAP(group2_mask) <<
    SENS_TOUCH_PAD_OUTEN2_S));
}

/****************************************************************************
 * Name: touch_lh_read_trigger_status_mask
 *
 * Description:
 *   Get the channels that triggered a touch interrupt.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   Bitmask of the channels that triggered a touch interrupt.
 *
 ****************************************************************************/

static inline uint32_t touch_lh_read_trigger_status_mask(void)
{
  return TOUCH_LH_BITS_SWAP(
    REG_GET_FIELD(SENS_SAR_TOUCH_CTRL2_REG, SENS_TOUCH_MEAS_EN));
}

/****************************************************************************
 * Name: touch_lh_clear_trigger_status_mask
 *
 * Description:
 *   Clear the touch interrupt channels bitmask.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_clear_trigger_status_mask(void)
{
  REG_SET_FIELD(SENS_SAR_TOUCH_CTRL2_REG, SENS_TOUCH_MEAS_EN_CLR, true);
}

/****************************************************************************
 * Name: touch_lh_intr_enable
 *
 * Description:
 *   Enable the touch interrupt.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_intr_enable(void)
{
  REG_SET_FIELD(RTC_CNTL_INT_ENA_REG, RTC_CNTL_TOUCH_INT_ENA, true);
}

/****************************************************************************
 * Name: touch_lh_intr_disable
 *
 * Description:
 *   Disable the touch interrupt.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_intr_disable(void)
{
  REG_SET_FIELD(RTC_CNTL_INT_ENA_REG, RTC_CNTL_TOUCH_INT_ENA, false);
}

/****************************************************************************
 * Name: touch_lh_intr_clear
 *
 * Description:
 *   Clear the touch interrupt status.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void touch_lh_intr_clear(void)
{
  REG_SET_FIELD(RTC_CNTL_INT_CLR_REG, RTC_CNTL_TOUCH_INT_CLR, true);
}

/****************************************************************************
 * Name: touch_lh_read_raw_data
 *
 * Description:
 *   Get the measured value for a given touch pad.
 *
 * Input Parameters:
 *   tp - The touch pad channel.
 *
 * Returned Value:
 *   The current measured value for that touch pad.
 *
 ****************************************************************************/

static inline uint16_t touch_lh_read_raw_data(enum touch_pad_e tp)
{
  enum touch_pad_e tp_wrap = touch_lh_num_wrap(tp);

  const uint32_t reg_addr[] =
  {
    SENS_SAR_TOUCH_OUT1_REG,
    SENS_SAR_TOUCH_OUT2_REG,
    SENS_SAR_TOUCH_OUT3_REG,
    SENS_SAR_TOUCH_OUT4_REG,
    SENS_SAR_TOUCH_OUT5_REG,
  };

  if (tp_wrap & 0x1) /* Odd */
    {
      /* All odd touch pads have the same position for the MEAS_OUTN bits.
       * We can use any odd SENS_TOUCH_MEAS_OUTN.
       */

      return REG_GET_FIELD(reg_addr[tp_wrap / 2], SENS_TOUCH_MEAS_OUT1);
    }
  else /* Even */
    {
      /* All even touch pads have the same position for the MEAS_OUTN bits.
       * We can use any even SENS_TOUCH_MEAS_OUTN.
       */

      return REG_GET_FIELD(reg_addr[tp_wrap / 2], SENS_TOUCH_MEAS_OUT0);
    }
}

/****************************************************************************
 * Name: touch_lh_meas_is_done
 *
 * Description:
 *   Check if measurement is done.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   True if yes, false if no.
 *
 ****************************************************************************/

static inline bool touch_lh_meas_is_done(void)
{
  return (bool) REG_GET_FIELD(SENS_SAR_TOUCH_CTRL2_REG,
                              SENS_TOUCH_MEAS_DONE);
}

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#ifdef __cplusplus
}
#endif
#undef EXTERN

#endif /* __ASSEMBLY__ */
#endif /* __ARCH_XTENSA_SRC_ESP32_ESP32_TOUCH_LOWERHALF_H */
